Repository: KuuuGR/Digmitto
Catalog: Digmitto/Digmitto/Resources/*.lproj/Localizable.strings
Languages: es, pl, ru

# tut_step_6
source: Step 6: To clarify mistakes, the app shows the expected code for the word and the code you entered on the wheels. Unfortunately, the score won't increase for corrected answers.
es: Paso 6: Para aclarar errores, la aplicación muestra el código esperado y tu entrada en las ruedas. No se otorgan puntos por intentos corregidos.
pl: Krok 6: Aby wyjaśnić błędy, aplikacja pokazuje oczekiwany kod oraz Twój wpis na kołach. Za poprawione próby punkty nie są przyznawane.
ru: Шаг 6: Для разъяснения ошибок приложение показывает ожидаемый код и ваш ввод на колёсах. За исправленные попытки очки не начисляются.

# tut_step_7
source: Step 7: There are two helper tools to make the learning process easier.
es: Paso 7: La aplicación ofrece dos herramientas de ayuda para facilitar el aprendizaje.
pl: Krok 7: Aplikacja oferuje dwa narzędzia pomocnicze, które ułatwiają naukę.
ru: Шаг 7: Приложение предоставляет два вспомогательных инструмента для обучения.

# tut_step_8
source: Step 8: Both helper tools can be enabled in the application settings.
es: Paso 8: Ambas herramientas se pueden activar en los ajustes de la aplicación.
pl: Krok 8: Oba narzędzia pomocnicze można włączyć w ustawieniach aplikacji.
ru: Шаг 8: Оба инструмента можно включить в настройках приложения.

# tut_step_9
source: Step 9: The first helper highlights letters that correspond to numbers. The colors for these letters and the letters to be ignored can be customized in the settings.
es: Paso 9: La primera herramienta resalta las letras que corresponden a los dígitos. Puedes personalizar sus colores y la lista de letras a ignorar en los ajustes.
pl: Krok 9: Pierwsze narzędzie podświetla litery odpowiadające cyfrom. Możesz dostosować kolory tych liter oraz listę ignorowanych liter w ustawieniach.
ru: Шаг 9: Первый инструмент подсвечивает буквы, соответствующие цифрам. Вы можете настроить его цвета и список игнорируемых букв в настройках.

# tut_step_10
source: Step 10: The second helper is a cheat sheet showing letters and their corresponding numbers. You can refer to this sheet if you forget any values.
es: Paso 10: La segunda herramienta es una hoja de trucos que muestra la asociación entre letras y dígitos. Úsala si olvidas algún valor.
pl: Krok 10: Drugie narzędzie to ściągawka wyświetlająca przyporządkowanie liter do cyfr. Użyj jej, jeśli zapomnisz jakiejś wartości.
ru: Шаг 10: Второй инструмент — это шпаргалка, показывающая соответствие букв цифрам. Используйте её, если забудете какое-либо значение.

# tut_step_11
source: Step 11: Random words can be very long, sometimes exceeding the number of visible wheels on the screen.
es: Paso 11: Las palabras aleatorias pueden ser muy largas, a veces más de lo que muestran las ruedas.
pl: Krok 11: Losowe wyrazy mogą być bardzo długie, czasem dłuższe niż widoczne koła.
ru: Шаг 11: Случайные слова могут быть очень длинными, иногда длиннее, чем видны колёса.

# tut_step_12
source: Step 12: To resolve this, switch the screen orientation to horizontal.
es: Paso 12: Para solucionarlo, cambia la orientación de la pantalla a horizontal.
pl: Krok 12: Aby to rozwiązać, przełącz orientację ekranu na poziomą.
ru: Шаг 12: Чтобы решить эту проблему, переключите ориентацию экрана на горизонтальную.

# tut_step_13
source: Step 13: This horizontal position prevents the wheels from shrinking and ensures the entire coded number is visible.
es: Paso 13: La orientación horizontal evita que las ruedas se reduzcan y asegura que se vea el número completo.
pl: Krok 13: Orientacja pozioma zapobiega zmniejszaniu się kół i zapewnia pełną widoczność liczby.
ru: Шаг 13: Горизонтальная ориентация предотвращает уменьшение колёс и обеспечивает полное отображение числа.

# tut_step_14
source: Step 14: The wheels are grouped into sets of three, counted from the last number.
es: Paso 14: Las ruedas se agrupan en tríos, empezando por el último dígito.
pl: Krok 14: Koła są grupowane w zestawy po trzy, licząc od ostatniej cyfry.
ru: Шаг 14: Колёса группируются в тройки, начиная с последней цифры.

# tut_step_15
source: Step 15: This grouping helps you learn to read numbers in units, tens, thousands, millions, etc.
es: Paso 15: Este agrupamiento te ayuda a leer los números en unidades, decenas, miles, millones, etc.
pl: Krok 15: Takie grupowanie pomaga w odczytywaniu liczb – jednostek, dziesiątek, tysięcy, milionów itd.
ru: Шаг 15: Такое группирование помогает читать числа по разрядам: единицы, десятки, тысячи, миллионы и т.д.

# tut_step_16
source: Step 16: The application tracks points for each session and maintains a total cumulative score across all sessions.
es: Paso 16: La aplicación registra los puntos de cada sesión, además de un total acumulado.
pl: Krok 16: Aplikacja śledzi punkty za każdą sesję oraz sumaryczny wynik we wszystkich sesjach.
ru: Шаг 16: Приложение отслеживает очки за каждую сессию, а также суммарное количество очков.

# tut_step_17
source: Step 17: You can view your points on the main screen or in the 'View Points' section.
es: Paso 17: Puedes ver tus puntos en la vista principal o en la sección 'View Points'.
pl: Krok 17: Punkty możesz sprawdzić na głównym ekranie lub w sekcji 'View Points'.
ru: Шаг 17: Вы можете посмотреть свои очки на главном экране или в разделе «View Points».

# mnm_title
source: Easier memorization
es: Memorización más fácil
pl: Łatwiejsze zapamiętywanie
ru: Лёгкое запоминание

# mnm_step_0
source: Easier memorization is possible with the help of mnemonic techniques. The best mnemonics are the ones you create yourself, but here are some suggestions in case you find it hard to come up with your own.
es: La memorización más fácil es posible gracias a técnicas mnemotécnicas. Las mejores mnemotecnias son las que tú mismo creas, pero aquí tienes algunas sugerencias si te cuesta idear las tuyas.
pl: Zapamiętywanie jest łatwiejsze dzięki mnemotechnikom. Najlepsze jednak to te, które stworzysz sam. Jeśli masz trudności z wymyśleniem własnych użyj poniższych.
ru: Запоминание становится проще благодаря мнемотехническим приёмам. Лучшие мнемотехники — это те, что вы создаёте сами, но вот несколько предложений, если вам трудно придумать свои.

# mnm_step_1
source: 0 - S, Z: Imagine two snakes – one shaped like the letter S, the other like the letter Z – fighting over a donut that looks like the number 0.
es: 0 – S, Z: Imagina dos serpientes, una con forma de S y otra con forma de Z, luchando por un donut que se asemeja al número 0.
pl: 0 – S, Z: Wyobraź sobie dwa węże – jeden w kształcie litery S, drugi jak litera Z – walczące o pączka przypominającego cyfrę 0.
ru: 0 – S, Z: Представьте двух змей — одну в форме буквы S, другую в форме буквы Z, борющихся за пончик, похожий на цифру 0.

# mnm_step_2
source: 1 - T, D: Picture a door in the shape of the letter D that leads to room number 1. The door handle looks like the letter T – a mysterious door indeed.
es: 1 – T, D: Imagina una puerta con forma de D que conduce a la habitación número 1. La manija se parece a la letra T.
pl: 1 – T, D: Wyobraź sobie drzwi w kształcie litery D prowadzące do pokoju numer 1. Klamka przypomina literę T.
ru: 1 – T, D: Представьте дверь в форме буквы D, ведущую в комнату номер 1. Дверная ручка напоминает букву T.

# mnm_step_3
source: 2 - N: The letter N touches the line it’s written on in two places, as if it has two little legs.
es: 2 – N: La letra N toca la línea en dos puntos, como si tuviera dos pequeñas piernas.
pl: 2 – N: Litera N dotyka linii pisma w dwóch miejscach, jakby miała dwie małe nogi.
ru: 2 – N: Буква N касается линии письма в двух местах, словно у неё две маленькие ножки.

# mnm_step_4
source: 3 - M: The letter M touches the line in three places, which sets it apart from the previous letters.
es: 3 – M: La letra M toca la línea en tres puntos, destacándose entre las demás.
pl: 3 – M: Litera M dotyka linii w trzech miejscach, wyróżniając się spośród innych liter.
ru: 3 – M: Буква M касается линии в трёх местах, выделяясь среди остальных.

# mnm_step_5
source: 4 - R: The letter R can be heard clearly in the word 'four'. You can also imagine a four-leaf clover with an R in the center.
es: 4 – R: La letra R se pronuncia claramente en 'cuatro'. Imagina un trébol de cuatro hojas con una R en el centro.
pl: 4 – R: Litera R wymawiana jest wyraźnie w słowie 'cztery'. Wyobraź sobie czterolistną koniczynę z literą R w centrum.
ru: 4 – R: Буква R произносится отчётливо в слове «четыре». Представьте себе клевер с четырьмя листьями с буквой R в центре.

# mnm_step_6
source: 5 - L: In Roman numerals, the letter L represents 50, but we associate it with 5, which is easier to remember.
es: 5 – L: En los números romanos, L representa 50, pero aquí se asocia con el 5 para simplificar.
pl: 5 – L: W rzymskich liczbach litera L oznacza 50, ale kojarzymy ją z cyfrą 5.
ru: 5 – L: В римских цифрах L означает 50, но здесь она ассоциируется с цифрой 5 для простоты.

# mnm_step_7
source: 6 - J: To connect the number 6 with the letter J, picture a snail that looks like the number 6, with the letter J serving as the handle of an umbrella.
es: 6 – J: Para asociar el 6 con la J, imagina un caracol que se asemeja al número 6, con la J como el mango de un paraguas.
pl: 6 – J: Aby skojarzyć cyfrę 6 z literą J, wyobraź sobie ślimaka przypominającego cyfrę 6, z literą J jako rączką parasola.
ru: 6 – J: Чтобы ассоциировать 6 с буквой J, представьте улитку, похожую на цифру 6, с буквой J в роли ручки зонта.

# mnm_step_8
source: 7 - K, G: Seven is a big number, and it’s easy to associate it with a 7-kilogram weight. The abbreviation 'kg' contains the letters K and G.
es: 7 – K, G: El siete es un número grande. Piensa en un peso de 7 kg; 'kg' contiene las letras K y G.
pl: 7 – K, G: Siedem to duża liczba. Pomyśl o ciężarze 7 kg; skrót 'kg' zawiera litery K i G.
ru: 7 – K, G: Семь — большое число. Представьте груз весом 7 кг; аббревиатура «kg» содержит буквы K и G.

# mnm_step_9
source: 8 - W, F: Imagine a snowman shaped like the number 8, who has access to Wi-Fi. The letters W and F are the ones we care about.
es: 8 – W, F: Imagina un muñeco de nieve con forma de 8 que tenga acceso a Wi‑Fi.
pl: 8 – W, F: Wyobraź sobie bałwana w kształcie cyfry 8, który ma dostęp do Wi‑Fi.
ru: 8 – W, F: Представьте снеговика в форме цифры 8, у которого есть Wi‑Fi.

# mnm_step_10
source: 9 - P, B: Picture lead – the chemical element with the symbol Pb. Lead is very heavy, which makes it easy to associate with the largest single-digit number, 9.
es: 9 – P, B: Imagina plomo (Pb); el plomo es pesado, lo que lo asocia con el dígito 9.
pl: 9 – P, B: Wyobraź sobie ołów (Pb); ołów jest ciężki, co kojarzy się z dużą cyfrą 9.
ru: 9 – P, B: Представьте свинец (Pb); свинец тяжелый, что связывает его с цифрой 9.

# sd_support_title
source: Support the Developer
es: Apoya al Desarrollador
pl: Wesprzyj dewelopera
ru: Поддержите разработчика

# sd_support_message
source: If you like my app and want to support me, I would greatly appreciate it! Even the smallest donation means a lot to me.
es: Si te gusta mi aplicación y deseas apoyarme, ¡te lo agradeceré enormemente! Incluso la donación más pequeña significa mucho.
pl: Jeśli podoba Ci się moja aplikacja i chcesz mnie wesprzeć, będę bardzo wdzięczny! Nawet najmniejsza darowizna wiele znaczy.
ru: Если вам нравится мое приложение и вы хотите меня поддержать, я буду очень признателен! Даже самое маленькое пожертвование многое значит.

# sd_support_voluntary
source: Support is completely voluntary. Please only donate if you can afford to. Thank you for any help!
es: El apoyo es completamente voluntario. Por favor, dona solo si puedes permitirlo. ¡Gracias por cualquier ayuda!
pl: Wsparcie jest całkowicie dobrowolne. Proszę wpłacaj tylko, jeśli Cię stać. Dziękuję za każdą pomoc!
ru: Поддержка полностью добровольна. Пожалуйста, делайте пожертвования, только если вам это по карману. Спасибо за любую помощь!

# sd_support_button
source: Support Me
es: Apóyame
pl: Wesprzyj mnie
ru: Поддержите меня
