Repository: KuuuGR/Digmitto
Catalog: Digmitto/Digmitto/Resources/*.lproj/Localizable.strings
Languages: es, pl, ru

# tv_check_button
source: Check it
es: Verifícalo
pl: Sprawdź
ru: Проверь это

# tv_feedback_correct
source: Correct! 🌟
es: ¡Correcto! 🌟
pl: Poprawnie! 🌟
ru: Правильно! 🌟

# tv_feedback_incorrect
source: Try again! ❌ Letters: %@ Wheels: %@
es: ¡Inténtalo de nuevo! ❌ Letras: %@ Ruedas: %@
pl: Spróbuj ponownie! ❌ Litery: %@ Koła: %@
ru: Попробуй ещё раз! ❌ Буквы: %@ Колёса: %@

# tv_points
source: Points: %d
es: Puntos: %d
pl: Punkty: %d
ru: Очки: %d

# tv_fruits
source: Fruits: %@
es: Frutas: %@
pl: Owoce: %@
ru: Фрукты: %@

# tv_feedback_correct_special
source: Tutorial Level Completed
es: Nivel del tutorial completado
pl: Tutorial ukończony
ru: Уровень туториала завершён

# tv_feedback_correct_special_button_text
source: Great job!
es: ¡Buen trabajo!
pl: Świetna robota!
ru: Отличная работа!

# st_general
source: Choose Your Action
es: Elige tu acción
pl: Wybierz działanie
ru: Выберите действие

# st_start_task
source: Start Task
es: Iniciar tarea
pl: Rozpocznij zadanie
ru: Начать задание

# st_view_points
source: View Points
es: Ver puntos
pl: Pokaż punkty
ru: Посмотреть очки

# st_manuals
source: Manuals
es: Manuales
pl: Instrukcje
ru: Руководства

# st_how_to_start_title
source: How to Start?
es: ¿Cómo empezar?
pl: Jak zacząć?
ru: Как начать?

# st_instruction_step1
source: 1. Memorize letters that correspond to digits.
es: 1. Memoriza las letras que corresponden a los dígitos.
pl: 1. Zapamiętaj litery odpowiadające cyfrom.
ru: 1. Запомните буквы, соответствующие цифрам.

# st_instruction_bullet1
source: • Digit 1 corresponds to 't' or 'd'.
es: • El dígito 1 corresponde a 't' o 'd'.
pl: • Cyfra 1 odpowiada literom 't' lub 'd'.
ru: • Цифра 1 соответствует «t» или «d».

# st_instruction_bullet2
source: • Digit 2 corresponds to 'n'... (see manual for more).
es: • El dígito 2 corresponde a 'n'... (consulta el manual para más detalles).
pl: • Cyfra 2 odpowiada literze 'n'… (więcej w instrukcjach).
ru: • Цифра 2 соответствует «n»... (см. руководство для подробностей).

# st_instruction_step2
source: 2. Convert meaningful letters of the given word into a number.
es: 2. Convierte las letras significativas de la palabra en un número.
pl: 2. Przekształć znaczące litery wybranego wyrazu w liczbę.
ru: 2. Преобразуйте значимые буквы данного слова в число.

# st_instruction_bullet3
source: • Read the random word aloud.
es: • Lee la palabra aleatoria en voz alta.
pl: • Przeczytaj losowy wyraz na głos.
ru: • Произнесите случайное слово вслух.

# st_instruction_bullet4
source: • Read the resulting number.
es: • Lee el número resultante.
pl: • Odczytaj uzyskaną liczbę.
ru: • Прочитайте полученное число.

# st_instruction_bullet5
source: • Check if the answer is correct.
es: • Comprueba si la respuesta es correcta.
pl: • Sprawdź poprawność odpowiedzi.
ru: • Проверьте, верен ли ответ.

# st_instruction_bullet6
source: • If not, correct it and check again.
es: • Si no, corrígela y vuelve a intentarlo.
pl: • Jeśli nie, popraw ją i spróbuj ponownie.
ru: • Если нет, исправьте и попробуйте снова.

# fm_welcome
source: Welcome to the Tutorial!
es: ¡Bienvenido al tutorial!
pl: Witamy w tutorialu!
ru: Добро пожаловать в туториал!

# fm_tutorial_steps
source: Learn how to use the app in just three simple steps!
es: ¡Aprende a usar la aplicación en solo tres pasos sencillos!
pl: Poznaj działanie aplikacji w zaledwie trzech prostych krokach!
ru: Освойте работу с приложением всего за три простых шага!

# fm_dont_show_next_time
source: Don't show this tutorial next time
es: No mostrar este tutorial la próxima vez
pl: Nie pokazuj tego tutoriala przy następnym uruchomieniu
ru: Больше не показывать этот туториал

# fm_start
source: Get ready for practice!
es: ¡Vamos a practicar!
pl: Przejdźmy do ćwiczeń!
ru: Приготовьтесь к практике!

# tso_general
source: 📖 STEP ONE
es: 📖 PASO UNO
pl: 📖 KROK PIERWSZY
ru: 📖 ШАГ ПЕРВЫЙ

# tso_how_to_start_title
source: 🔹 The Major System – What is it and why use it?
es: 🔹 El Sistema Mayor – ¿Qué es y por qué usarlo?
pl: 🔹 System Majora – czym jest i dlaczego warto go stosować
ru: 🔹 Система Мажора – что это и зачем использовать?

# tso_word_for_practice
source: Dog
es: Perro
pl: pies
ru: Собака

# tso_instruction_step1
source: 1️⃣ Memorize long numbers easily and effectively
es: 1️⃣ Memoriza números largos de forma fácil y efectiva
pl: 1️⃣ Łatwo i skutecznie zapamiętuj długie liczby
ru: 1️⃣ Легко и эффективно запоминайте длинные числа

# tso_instruction_bullet1
source: • Learn the letter-to-digit mapping
es: • Aprende la correspondencia entre letras y dígitos
pl: • Poznaj przyporządkowanie liter do cyfr
ru: • Изучите соответствие букв цифрам

# tso_instruction_bullet2
source: • Practice by converting words into numbers
es: • Practica convirtiendo palabras en números
pl: • Ćwicz, zamieniając wyrazy na liczby
ru: • Практикуйтесь, преобразуя слова в числа

# tso_instruction_step2
source: 2️⃣ Exercise 1
es: 2️⃣ Ejercicio 1
pl: 2️⃣ Ćwiczenie 1
ru: 2️⃣ Упражнение 1

# tso_instruction_bullet3
source: • Let's start with the example word 'dog'
es: • Comienza con el ejemplo 'Perro'
pl: • Zacznij od przykładowego wyrazu 'pies'
ru: • Начнём с примера: слово «Собака»

# tso_instruction_bullet4
source: • In the Major System, the important letters are consonants: 'd' and 'g'
es: • En el Sistema Mayor, las letras importantes son las consonantes: 'p' y 'r'
pl: • W systemie Majora istotne są spółgłoski: 'p' i 's'
ru: • В системе Мажора важны согласные: «с» и «б»

# tso_instruction_bullet5
source: • 'D' corresponds to 1, and 'G' corresponds to 7
es: • 'P' corresponde a 9 y 'R' a 4
pl: • 'P' odpowiada cyfrze 9, a 'S' – cyfrze 0
ru: • «С» соответствует 0, а «Б» – 9

# tso_instruction_bullet6
source: • So, the number is 17 Try it by yourself!
es: • Así, el número es 944 ¡Pruébalo tú mismo!
pl: • Wynik: 90 Spróbuj samodzielnie!
ru: • Таким образом, число получается 09 Попробуйте сами!

# tso_start_task
source: Start Exercise
es: Iniciar ejercicio
pl: Rozpocznij ćwiczenie
ru: Начать упражнение

# tso_done
source: Go to step two
es: Ir al paso dos
pl: Przejdź do kroku drugiego
ru: Перейти к шагу два

# tstw_general
source: 📖 STEP TWO
es: 📖 PASO DOS
pl: 📖 KROK DRUGI
ru: 📖 ШАГ ДВА

# tstw_how_to_start_title
source: 🔹 Rome Wasn't Built in a Day
es: 🔹 Roma no se construyó en un día
pl: 🔹 Nie od razu Rzym zbudowano
ru: 🔹 Рим не был построен за один день

# tstw_word_for_practice
source: Dolphin
es: Delfín
pl: delfin
ru: Дельфин

# tstw_instruction_step1
source: 3️⃣ Cheat Sheet
es: 3️⃣ Hoja de trucos
pl: 3️⃣ Ściągawka i mnemotechniki
ru: 3️⃣ Шпаргалка

# tstw_instruction_bullet1
source: • You can enable the cheat sheet in the settings
es: • Puedes activar la hoja de trucos en los ajustes
pl: • Ściągawkę z przyporządkowań można włączyć w ustawieniach
ru: • Вы можете включить шпаргалку в настройках

# tstw_instruction_bullet2
source: • After completing the tutorial, check the manuals. They include mnemonic techniques to help you remember the letter-to-digit mapping
es: • Tras completar el tutorial, consulta los manuales. Incluyen técnicas mnemotécnicas para ayudarte a recordar la correspondencia letra-dígito
pl: • Po ukończeniu tutoriala sprawdź instrukcje – zawierają przygotowane mnemotechniki, które ułatwią Ci zapamiętanie przyporządkowań
ru: • После завершения туториала ознакомьтесь с руководствами, где приведены мнемотехнические приёмы для запоминания соответствия букв цифрам

# tstw_instruction_step2
source: 4️⃣ Exercise 2
es: 4️⃣ Ejercicio 2
pl: 4️⃣ Ćwiczenie 2
ru: 4️⃣ Упражнение 2

# tstw_instruction_bullet3
source: • Now, let's try the word 'dolphin'
es: • Ahora, probemos con la palabra 'Delfín'
pl: • Wypróbuj słowo 'delfin'
ru: • Теперь попробуйте слово «Дельфин»

# tstw_instruction_bullet4
source: • The important consonants are: 'd', 'l', 'p', 'n'
es: • Las consonantes importantes son: 'd', 'l', 'f', 'n'
pl: • Istotne spółgłoski to: 'd', 'l', 'f', 'n'
ru: • Важные согласные: «д», «л», «ф», «н»

# tstw_instruction_bullet5
source: • 'D' = 1, 'L' = 5, 'P' = 9, 'N' = 2 so we have 1 5 9 2
es: • 'D' = 1, 'L' = 5, 'F' = 8, 'N' = 2, lo que da 1 5 8 2
pl: • 'D' = 1, 'L' = 5, 'F' = 8, 'N' = 2, czyli: 1 5 8 2
ru: • «Д» = 1, «Л» = 5, «Ф» = 9, «Н» = 2, получаем 1 5 9 2

# tstw_instruction_bullet6
source: • Try it yourself! You can use the cheat sheet
es: • ¡Pruébalo tú mismo! Puedes usar la hoja de trucos
pl: • Spróbuj samodzielnie! Możesz korzystać ze ściągawki
ru: • Попробуйте сами! Можно использовать шпаргалку

# tstw_start_task
source: Start Exercise
es: Iniciar ejercicio
pl: Rozpocznij ćwiczenie
ru: Начать упражнение

# tstw_done
source: Go to step three
es: Ir al paso tres
pl: Przejdź do kroku trzeciego
ru: Перейти к шагу три

# tsth_general
source: 📖 STEP THREE
es: 📖 PASO TRES
pl: 📖 KROK TRZECI
ru: 📖 ШАГ ТРЕТИЙ

# tsth_how_to_start_title
source: 🔹 The Climb of Word Creation
es: 🔹 La escalada de la creación de palabras
pl: 🔹 Droga do tworzenia wyrazów
ru: 🔹 Подъем к созданию слов

# tsth_word_for_practice
source: Argentinosaurus
es: Argentinosaurio
pl: argentinozaur
ru: Аргентинозавр

# tsth_instruction_step1
source: 5️⃣ Words can be really long
es: 5️⃣ Las palabras pueden ser muy largas
pl: 5️⃣ Wyrazy mogą być bardzo długie
ru: 5️⃣ Слова могут быть очень длинными

# tsth_instruction_bullet1
source: • Words are randomly taken from a dictionary, which can be selected in the settings
es: • Las palabras se eligen al azar de un diccionario, que puedes seleccionar en los ajustes
pl: • Wyrazy są losowo wybierane z wybranego słownika
ru: • Слова выбираются случайным образом из словаря, который можно настроить в параметрах

# tsth_instruction_bullet2
source: • Long words are easier to enter when holding the iPhone horizontally
es: • Las palabras largas se ingresan más fácilmente en posición horizontal
pl: • Długie wyrazy łatwiej wpisywać, gdy trzymasz iPhone'a poziomo
ru: • Длинные слова легче вводить, если держать iPhone горизонтально

# tsth_instruction_step2
source: 6️⃣ Exercise 3
es: 6️⃣ Ejercicio 3
pl: 6️⃣ Ćwiczenie 3
ru: 6️⃣ Упражнение 3

# tsth_instruction_bullet3
source: • Now we have the word 'Argentinosaurus' 🦕
es: • Ahora tenemos la palabra 'Argentinosaurio' 🦕
pl: • Spróbuj teraz z wyrazem 'argentinozaur' 🦕
ru: • Теперь у нас слово «Аргентинозавр» 🦕

# tsth_instruction_bullet4
source: • Try doing it yourself using the cheat sheet
es: • Inténtalo tú mismo usando la hoja de trucos
pl: • Jeśli potrzebujesz, skorzystaj ze ściągawki
ru: • Попробуйте выполнить упражнение самостоятельно, используя шпаргалку

# tsth_instruction_bullet5
source: • Number wheels are grouped in triplets, making it easier to read numbers in tens, thousands, and millions
es: • Los engranajes de números se agrupan en tríos, facilitando la lectura de números en decenas, miles y millones
pl: • Koła z cyframi są grupowane w trójki, co ułatwia odczyt liczb (dziesiątki, tysiące, miliony)
ru: • Колёса с цифрами сгруппированы в тройки, что облегчает чтение чисел в десятках, тысячах и миллионах

# tsth_instruction_bullet6
source: • This is the final challenge!
es: • ¡Este es el desafío final!
pl: • To ostatnie wyzwanie!
ru: • Это последнее испытание!

# tsth_start_task
source: Start Exercise
es: Iniciar ejercicio
pl: Rozpocznij ćwiczenie
ru: Начать упражнение

# tsth_done
source: Finish the Tutorial
es: Finalizar el tutorial
pl: Zakończ tutorial
ru: Завершить туториал

# mn_general
source: How can I help you?
es: ¿En qué puedo ayudarte?
pl: W czym mogę Ci pomóc?
ru: Чем я могу помочь?

# mn_major_numbers
source: Major numbers asociation
es: Asociaciones del Sistema Mayor
pl: Przyporządkowania Systemu Majora
ru: Соответствия системы Мажора

# mn_app_manual
source: Overall APP Manual
es: Manual completo de la aplicación
pl: Kompletny podręcznik aplikacji
ru: Полное руководство по приложению

# mn_numbers_mnemotechnics
source: easier association remember
es: Técnicas mnemotécnicas para facilitar las asociaciones
pl: Mnemotechniki ułatwiające przyporządkowanie
ru: Мнемотехнические приёмы для облегчения ассоциаций

# sv_general_settings
source: General Settings
es: Ajustes generales
pl: Ustawienia ogólne
ru: Общие настройки

# sv_enable_cheat_sheet
source: Enable Cheat Sheet
es: Hoja de trucos
pl: Włącz ściągawkę
ru: Шпаргалка

# sv_language
source: Language
es: Diccionario
pl: Słownik
ru: Словарь

# sv_language_english
source: English
es: Inglés
pl: Angielski
ru: Английский

# sv_language_polish
source: Polish
es: Polaco
pl: Polski
ru: Польский

# sv_language_spanish
source: Spanish
es: Español
pl: Hiszpański
ru: Испанский

# sv_colorization_settings
source: Colorization Settings
es: Ajustes de coloración
pl: Ustawienia kolorowania
ru: Настройки цветового оформления

# sv_enable_colorization
source: Enable Colorization
es: Coloración
pl: Włącz kolorowanie
ru: Цветовое оформление

# sv_primary_color
source: Primary Color
es: Color primario
pl: Kolor podstawowy
ru: Основной цвет

# sv_secondary_color
source: Secondary Color
es: Color secundario
pl: Kolor dodatkowy
ru: Вторичный цвет

# sv_default_color_settings
source: Default Color Setting
es: Ajustes del color por defecto
pl: Ustawienia koloru domyślnego
ru: Настройки цвета по умолчанию

# sv_default_color
source: Default Color
es: Color por defecto
pl: Kolor domyślny
ru: Цвет по умолчанию

# sv_major_system_letters
source: Major System Letters
es: Letras del Sistema Mayor
pl: Litery Systemu Majora
ru: Буквы системы Мажора

# sv_major_letters
source: Major Letters
es: Letras significativas
pl: Litery znaczące
ru: Значимые буквы

# sv_enter_letters
source: Enter letters
es: Introduce las letras
pl: Wprowadź litery
ru: Введите буквы

# sv_settings_title
source: Settings
es: Ajustes
pl: Ustawienia
ru: Настройки

# sv_additional_settings
source: Additional Settings
es: Ajustes adicionales
pl: Dodatkowe ustawienia
ru: Дополнительные настройки

# sv_enable_randomizing_dice
source: Enable manual word randomization
es: Dados de palabras
pl: Kostka losowych słów
ru: Кубик со словами

# pw_title
source: Points
es: Puntos
pl: Punkty
ru: Очки

# pw_total
source: Total Points
es: Puntos totales
pl: Łącznie punktów
ru: Всего очков

# pw_achievements
source: Achievements
es: Logros
pl: Osiągnięcia
ru: Достижения

# ach_description_0
source: Champion: Reach 500 points.
es: Champion: Alcanza 500 puntos.
pl: Mistrz: Osiągnij 500 punktów.
ru: Champion: Наберите 500 очков.

# ach_description_1
source: First Steps: Complete your first task.
es: First Steps: Completa tu primera tarea.
pl: Pierwszy krok: Ukończ swoje pierwsze zadanie.
ru: First Steps: Выполните своё первое задание.

# ach_description_2
source: Memory Master: Reach 100 points.
es: Memory Master: Alcanza 100 puntos.
pl: Pamięciak: Osiągnij 100 punktów.
ru: Memory Master: Наберите 100 очков.

# ach_description_3
source: Speed Demon: Solve 10 tasks in under a minute.
es: Speed Demon: Resuelve 10 tareas en menos de un minuto.
pl: Szybciok: Rozwiąż 10 zadań w mniej niż minutę.
ru: Speed Demon: Решите 10 заданий за меньше чем минуту.

# ach_description_4
source: Perfect Session: Complete a session without mistakes.
es: Perfect Session: Completa una sesión sin errores.
pl: Idealista: Ukończ sesję bez błędów.
ru: Perfect Session: Завершите сессию без ошибок.

# ach_description_5
source: Consistent Learner: Use the app daily for a week.
es: Consistent Learner: Usa la aplicación diariamente durante una semana.
pl: Wytrwałość: Korzystaj z aplikacji codziennie przez tydzień.
ru: Consistent Learner: Используйте приложение ежедневно в течение недели.

# ach_description_6
source: Fruit Collector: Collect all fruit icons.
es: Fruit Collector: Recoge todos los íconos de fruta.
pl: Owocozbieracz: Zbierz wszystkie ikony owoców.
ru: Fruit Collector: Соберите все иконки фруктов.

# ach_description_7
source: Grocery Seller: Collect all fruits in a single session.
es: Grocery Seller: Recoge todas las frutas en una sola sesión.
pl: Pani z Warzywniaka: Zbierz wszystkie owoce w jednej sesji.
ru: Grocery Seller: Соберите все фрукты за одну сессию.

# ach_description_8
source: Coconut Collector: Obtain a coconut as one of your collected fruits.
es: Coconut Collector: Obtén un coco entre tus frutas recolectadas.
pl: Kokosowoc: Otrzymaj kokos wśród zebranych owoców.
ru: Coconut Collector: Получите кокос среди собранных фруктов.

# hs_welcome
source: Welcome to Major Memory System
es: Bienvenido a Major Memory System
pl: Witamy w Major Memory System
ru: Добро пожаловать в Major Memory System

# hs_start_button
source: Start
es: Iniciar
ru: Начать

# hs_settings_button
source: Settings
es: Ajustes
pl: Ustawienia
ru: Настройки

# hs_about_button
source: About
es: Acerca de
pl: O aplikacji
ru: О приложении

# hs_total_points_format
source: Total Points: %d
es: Puntos totales: %d
pl: Łącznie punktów: %d
ru: Всего очков: %d

# cs_title
source: 📜 Major System Cheat Sheet 📜
es: 📜 Hoja de trucos del Sistema Mayor 📜
pl: 📜 Ściągawka Systemu Majora 📜
ru: 📜 Шпаргалка системы Мажора 📜

# ab_title
source: About Major System
es: Acerca del Sistema Mayor
pl: O Systemie Majora
ru: О системе Мажора

# ab_what_is
source: What is the Major System?
es: ¿Qué es el Sistema Mayor?
pl: Czym jest System Majora?
ru: Что такое система Мажора?

# ab_what_is_description
source: The Major System is a mnemonic technique that helps you remember numbers by converting them into consonant sounds, which can then be made into words.
es: El Sistema Mayor es una técnica mnemotécnica que te ayuda a recordar números convirtiéndolos en sonidos consonánticos, que luego se pueden formar en palabras.
pl: System Majora to technika mnemotechniczna, która pomaga zapamiętywać liczby poprzez przekształcanie ich w dźwięki spółgłoskowe, z których można tworzyć wyrazy.
ru: Система Мажора — это мнемотехнический метод, который помогает запоминать числа, преобразуя их в согласные звуки, из которых можно составлять слова.

# ab_how_it_works
source: How it works:
es: Cómo funciona:
pl: Jak to działa:
ru: Как это работает:

# ab_how_it_works_bullet1
source: • Each digit is assigned to specific consonant sounds
es: • A cada dígito se le asignan sonidos consonánticos específicos.
pl: • Każdej cyfrze przypisane są określone dźwięki spółgłoskowe.
ru: • Каждой цифре соответствуют определённые согласные звуки.

# ab_how_it_works_bullet2
source: • Vowels and unused consonants can be added freely
es: • Se pueden agregar libremente vocales y letras no asignadas.
pl: • Do samogłosek i liter bez przyporządkowania można dodawać dowolne znaki.
ru: • Гласные и неиспользуемые буквы можно добавлять произвольно.

# ab_how_it_works_bullet3
source: • Create words using these sounds to remember numbers
es: • Forma palabras usando estos sonidos para ayudarte a recordar los números.
pl: • Twórz wyrazy z tych dźwięków, aby łatwiej zapamiętać liczby.
ru: • Составляйте слова из этих звуков, чтобы легче запомнить числа.

# ab_examples
source: Examples:
es: Ejemplos:
pl: Przykłady:
ru: Примеры:

# ab_developer_info
source: Developer Info
es: Información del desarrollador
pl: Informacje o deweloperze
ru: Информация о разработчике

# ab_section_about_app
source: About the App
es: Acerca de la aplicación
pl: O aplikacji
ru: Об приложении

# ab_app_name
source: App: Digmitto
es: Aplicación: Digmitto
pl: Aplikacja: Digmitto
ru: Приложение: Digmitto

# ab_version
source: Version: 1.0.0
es: Versión: 1.0.0
pl: Wersja: 1.0.0
ru: Версия: 1.0.0

# ab_developer
source: Developer: Grzegorz Kulesza
es: Desarrollador: Gřegoř Kuleša
pl: Deweloper: Grzegorz Kulesza
ru: Разработчик: Гжегож Кулеша

# ab_section_purpose
source: What is the app for?
es: ¿Para qué sirve la aplicación?
pl: Do czego służy aplikacja?
ru: Для чего предназначено приложение?

# ab_purpose_major_system
source: • Learn coding in the Major System.
es: • Aprende a usar el Sistema Mayor.
pl: • Naucz się korzystać z Systemu Majora.
ru: • Изучите, как пользоваться системой Мажора.

# ab_purpose_large_numbers
source: • Learn reading large numbers.
es: • Aprende a leer números grandes.
pl: • Naucz się odczytywać duże liczby.
ru: • Научитесь читать большие числа.

# ab_purpose_dates
source: • Learn memorizing historical dates.
es: • Memoriza fechas históricas.
pl: • Zapamiętuj historyczne daty.
ru: • Запоминайте исторические даты.

# ab_purpose_words
source: • Learn quick reading of words.
es: • Practica el reconocimiento rápido de palabras.
pl: • Ćwicz szybkie rozpoznawanie wyrazów.
ru: • Практикуйте быстрое распознавание слов.

# ab_section_support
source: Support
es: Soporte
pl: Wsparcie
ru: Поддержка

# ab_support_developer
source: Support the Developer 🫶
es: Apoya al desarrollador 🫶
pl: Wesprzyj dewelopera 🫶
ru: Поддержите разработчика 🫶

# ab_navigation_title
source: About the App
es: Acerca de la aplicación
pl: O aplikacji
ru: Об приложении

# ma_title
source: Digits-to-letters association
es: Asociación de dígitos a letras
pl: Przyporządkowanie cyfr do liter
ru: Соответствие цифр и букв

# ma_step_0
source: O - S,Z
es: 0 – S, Z
pl: 0 – S, Z
ru: 0 – S, Z

# guide_title
source: Guide Walkthrough
es: Guía de uso
pl: Przewodnik
ru: Руководство

# tut_step_0
source: Welcome to the Digmitto app! Here's how to get started.
es: ¡Bienvenido a la aplicación Digmitto! Así es como comienzas.
pl: Witamy w aplikacji Digmitto! Oto jak zacząć.
ru: Добро пожаловать в приложение Digmitto! Вот как начать.

# tut_step_1
source: Step 1: Use the 'Start Task' button to access the main application view.
es: Paso 1: Usa el botón 'Start Task' para acceder a la vista principal de la aplicación.
pl: Krok 1: Użyj przycisku 'Start Task', aby przejść do głównego widoku aplikacji.
ru: Шаг 1: Нажмите кнопку «Start Task», чтобы перейти к основному экрану приложения.

# tut_step_2
source: Step 2: In this view, you will find three key elements: • a random word, • number wheels to set a value, and • a 'Check' button to compare the word with the selected number.
es: Paso 2: En esta vista encontrarás tres elementos clave: • Una palabra aleatoria, • Ruedas con dígitos para configurar un valor, y • Un botón 'Check' que compara la palabra con el número configurado.
pl: Krok 2: W tym widoku znajdziesz trzy kluczowe elementy: • Losowy wyraz, • Koła z cyframi do ustawienia wartości, • Przyciski 'Check', które porównują wyraz z ustawioną liczbą.
ru: Шаг 2: На этом экране вы найдете три основных элемента: • Случайное слово, • Колёса с цифрами для установки значения, • Кнопку «Check», которая сравнивает слово с заданным числом.

# tut_step_3
source: Step 3: If the answer is correct, you will see the message 'Correct! 🌟'.
es: Paso 3: Si la respuesta es correcta, verás '¡Correcto! 🌟'.
pl: Krok 3: Jeśli odpowiedź będzie poprawna, zobaczysz 'Poprawnie! 🌟'.
ru: Шаг 3: Если ответ верный, вы увидите «Правильно! 🌟».

# tut_step_4
source: Step 4: For each first-attempt correct answer, you will earn +1 point and a fruit icon.
es: Paso 4: Por cada respuesta correcta en el primer intento, ganas +1 punto y un ícono de fruta.
pl: Krok 4: Za każdą poprawną odpowiedź podaną za pierwszym razem otrzymasz +1 punkt oraz ikonę owocu.
ru: Шаг 4: За каждый правильный ответ с первого раза вы получаете +1 очко и значок фрукта.

# tut_step_5
source: Step 5: If you press 'Check' but the answer is incorrect, the message 'Try again! ❌' will appear. In this case, correct your answer to proceed to the next word.
es: Paso 5: Si presionas 'Check' y la respuesta es incorrecta, aparecerá '¡Inténtalo de nuevo! ❌'. Corrige tu respuesta para continuar.
pl: Krok 5: Jeśli naciśniesz 'Check', a odpowiedź będzie błędna, pojawi się komunikat 'Spróbuj ponownie! ❌'. Popraw swoją odpowiedź, aby przejść dalej.
ru: Шаг 5: Если вы нажмете «Check» и ответ окажется неверным, появится сообщение «Попробуйте ещё раз! ❌». Исправьте ответ, чтобы продолжить.
